Today, We're going to continue to get familiarized with PostgreSQL's date and time functions - picking up where we left off last week and the moving into some other commonly used functions

Both beginners and more advanced users will find something useful here!

We're gonna cover the following topics:
- Date intervals
- The Overlaps operator
- The AGE function
- Formatting dates and times
- Coalsece function
- Greatest and Least functions
- Nulliff function


We're going to be using `DB Fiddle` for this course. 

Navigate to: https://www.db-fiddle.com/

In the top right corner of the webpage, be sure to select `Database: PostgreSQL 13`

Now, in the `Schema SQL` pane on the left copy and paste the following, or just click this link here: https://www.db-fiddle.com/f/9hh1sKDrTkgxKV4U6VX7h5/0

Note: for the first half of this class we are using the same schema as the last class, and then switching schemas later when we finish up the date time functions.

```
CREATE TABLE IF NOT EXISTS "route" (
    "code" TEXT,
    "from_airport" TEXT,
    "to_airport" TEXT,
    "distance" INT,
    "departure_time" time,
    "arrival_time" time
);
INSERT INTO "route" VALUES
    ('PA2342','FRA','WAW',558,'07:55:00','09:30:00'),
    ('PA8793','MAD','NRT',6701,'13:20:00','04:35:00'),
    ('PA5643','GLA','DUB',185,'21:50:00','22:50:00'),
    ('PA8744','WMI','CRL',710,'10:25:00','12:15:00'),
    ('PA2134','KEF','GDN',1564,'21:25:00','00:55:00'),
    ('PA3424','BLQ','MAD',807,'08:00:00','10:45:00'),
    ('PA7155','JFK','CDG',5847,'11:05:00','18:35:00'),
    ('PA6851','LHR','PRY',8949,'16:55:00','11:35:00'),
    ('PA3425','ARN','SXF',810,'14:15:00','15:50:00'),
    ('PA1269','FCO','CDG',1100,'18:05:00','20:15:00'),
    ('PA7653','VCE','FCO',550,'19:20:00','20:40:00'),
    ('PA4097','ZRH','MUC',240,'23:15:00','23:55:00'),
    ('PA8542','FRA','NRT',9300,'02:10:00','13:45:00'),
    ('PA9073','WAW','LHR',1445,'05:00:00','08:15:00');
    
    
CREATE TABLE IF NOT EXISTS "aircraft" (
    "id" INT,
    "model" TEXT,
    "produced_date" TIMESTAMP,
    "registration_timestamp" TIMESTAMP,
    "launched_timestamp" TIMESTAMP,
    "withdrawn_timestamp" TIMESTAMP
);
INSERT INTO "aircraft" VALUES
    (1,'Airbus A321-200','2014-04-05 00:00:00','2014-04-15 00:00:00','2014-06-10 07:55:00',null),
    (2,'Airbus A333-300','2014-01-03 00:00:00','2014-01-13 00:00:00','2015-01-01 13:19:00',null),
    (3,'Boeing 737-800','2010-03-01 00:00:00','2010-03-11 00:00:00','2010-04-01 21:58:00','2015-10-14 20:00:00'),
    (4,'Airbus A320','2008-04-06 00:00:00','2008-04-09 00:00:00','2014-01-01 21:19:00',null),
    (5,'Boeing 737-800','2009-12-31 00:00:00','2009-12-31 00:00:00','2012-01-01 10:14:00','2016-08-01 09:30:00'),
    (6,'Airbus A320','2009-04-13 00:00:00','2009-04-19 00:00:00','2014-01-05 21:38:00','2013-01-05 21:38:00'),
    (7,'Boeing 787-10','2011-01-01 00:00:00','2011-02-01 00:00:00','2011-11-17 11:17:00',null),
    (8,'Boeing 777-300','1993-08-26 00:00:00','1993-08-30 00:00:00','2015-12-31 22:13:00','2016-10-15 12:52:00'),
    (9,'Airbus A300-600','2013-01-01 00:00:00','2013-01-11 00:00:00','2014-02-23 06:53:00','2015-10-14 00:19:00'),
    (10,'Airbus A380-900','2007-10-25 00:00:00','2007-11-29 00:00:00','2014-12-31 15:15:00',null),
    (11,'Embraer 170','2012-12-31 00:00:00','2013-01-12 00:00:00','2013-01-01 16:52:00',null),
    (12,'Vision SF50','2015-01-01 00:00:00','2015-02-01 00:00:00','2016-01-01 09:31:00',null),
    (13,'Airbus A320','2016-06-06 00:00:00','2016-07-01 00:00:00','2016-08-28 10:35:00',null),
    (14,'Embraer 170','2016-08-10 00:00:00','2016-09-05 00:00:00','2016-09-20 16:23:00',null),
    (15,'Boeing 777-800','2010-03-01 00:00:00','2010-04-08 00:00:00','2012-01-01 10:14:00',null);

CREATE TABLE IF NOT EXISTS "flight" (
    "id" INT,
    "route_code" TEXT,
    "aircraft_id" INT,
    "flight_date" DATE,
    "delay" INT
);
INSERT INTO "flight" VALUES
    (1,'PA2342',1,'2016-04-03',0),
    (2,'PA2342',1,'2016-01-01',15),
    (3,'PA8793',2,'2015-07-11',-13),
    (4,'PA5643',3,'2014-12-31',5),
    (5,'PA5643',3,'2015-08-13',0),
    (6,'PA5643',3,'2015-08-14',35),
    (7,'PA5643',3,'2016-01-01',8),
    (8,'PA8744',3,'2016-01-20',0),
    (9,'PA8744',3,'2016-02-21',-25),
    (10,'PA2134',4,'2015-10-10',-10),
    (11,'PA2134',4,'2015-08-14',16),
    (12,'PA2342',5,'2015-12-30',4),
    (13,'PA7155',7,'2016-06-08',20),
    (14,'PA6851',7,'2015-12-31',5),
    (15,'PA8744',9,'2015-08-31',30),
    (16,'PA5643',8,'2015-01-01',0),
    (17,'PA6851',10,'2016-02-26',-5),
    (18,'PA8793',10,'2016-04-03',45),
    (19,'PA3425',1,'2016-04-09',20),
    (20,'PA1269',2,'2016-08-11',5);
```

# Difference between timestamps

Let's move on. 

Our database can add and subtract dates. Take a look:

```
SELECT withdrawn_timestamp - launched_timestamp AS difference
FROM aircraft
WHERE withdrawn_timestamp IS NOT NULL;
```

The above query will calculate the difference between the columns withdrawn_timestamp and launched_timestamp. What will the result look like? 

Let's find out.


The results are intervals, which tell us the difference between the two timestamps:

`0 years 0 mons 1673 days 23 hours 16 mins 0.00 secs`

PostgresSQL provides the interval data type. The simplest way to create an interval in with the syntax:

`INTERVAL 'x field'`

x is a number, its unit can be any of millennium, century, decade, year, month, week, day, hour, minute, second, millisecond, microsecond, or abbreviations (y, m, d, etc.) or plural forms (months, days, etc.). Example intervals can be:

- `INTERVAL '2 hours'`
- `INTERVAL '3 days'`
- `INTERVAL '5 months'`
- `INTERVAL '1 year'`

You can add such intervals to a date/timestamp:

```
SELECT
  id,
  launched_timestamp,
  launched_timestamp + INTERVAL '1 year' AS new_launched_timestamp
FROM aircraft;
```

The above query will add one year to each launched timestamp in the aircraft table.

# Exercise

PerfectAir decided to use the withdrawn aircraft with ID of 3 once again. Show its original withdrawn timestamp and the withdrawn timestamp postponed by 6 months as the new_launched_timestamp column.

```
SELECT
  withdrawn_timestamp,
  withdrawn_timestamp + INTERVAL '6 months' AS new_launched_timestamp
FROM aircraft
WHERE id = 3;
```

Let's use a few INTERVALs right away:

```
SELECT
  withdrawn_timestamp,
  withdrawn_timestamp
    + INTERVAL '1 year'
    - INTERVAL '3 month'
    AS new_launched_timestamp
FROM aircraft
WHERE id = 3;`

```

The above query will add one year minus three months to the timestamp stored in the withdrawn_timestamp column. (Yes, you may simply add 9 months, this is just an example ðŸ˜‰)

You can also create an interval with multiple fields, using this syntax:

- `INTERVAL '1 year 2 months 3 days'`
- `INTERVAL '2 weeks ago'`

For example:

```
SELECT
  withdrawn_timestamp,
  withdrawn_timestamp
    + INTERVAL '1 year 3 months'
    AS new_launched_timestamp
FROM aircraft
WHERE id = 3;
```

# Exercise

PerfectAir, due to unexpected work on the runway of Frankfurt airport (the FRA code). needs to reschedule all departing flights... Show the code, new departure and arrival times forwarded by 1 hour and 15 minutes (show these as new_departure_time and new_arrival_time columns).

```
SELECT
  code,
  departure_time + INTERVAL '1 hour 15 minutes' AS new_departure_time,
  arrival_time   + INTERVAL '1 hour 15 minutes' AS new_arrival_time
FROM route
WHERE from_airport = 'FRA';
```

# INTERVAL with constant values


You can also use intervals with a constant value which you provide on your own. There is, however, one catch.

`SELECT '2015-01-01' + INTERVAL '5 day';`

The addition failed because our database thinks that '2015-01-01' is a common text value (string) and it's not able to add an interval to a text field. 

What can we do then? We can explicitly convert '2015-01-01' to a date/timestamp:

`SELECT '2015-01-01'::timestamp + INTERVAL '5 days';`

If you recall, PostgreSQL delivers the double colon operator (::) to convert one data type to another. 

On the left, we have the value to be converted to another data typem specified by the data type on the right. In this example, the string '2015-01-01' is converted to a timestamp data type. 

Now, it's possible to add an interval (5 days) to the date and time. In the same way, we can convert strings containing dates to date data type. Look at the another example:

`SELECT '2015-01-01'::date + INTERVAL '5 day';`

Let's see if it works.


# Filtering with INTERVALs

Good! The query worked this time. Intervals are typically used with BETWEEN to select facts from a given day, month, year etc. Take a look:

```
SELECT id
FROM aircraft
WHERE produced_date >= '2010-01-01'
  AND produced_date <  '2010-01-01'::date + INTERVAL '1 year';
```

This query will look for aircraft produced in 2010. Note we needed to cast the string to date with the :: operator in order to add an interval.

# Exercise

Show the id and the model for all the aircraft produced in 2014 and 2015.

```
SELECT id, model
FROM aircraft
WHERE produced_date
BETWEEN '2014-01-01' AND '2014-01-01':: date + INTERVAL '2 years';
```

# Filtering with INTERVALs â€“ practice

Interval arithmetic is often used with intervals when we want to find facts for a specific month. We no longer need to check whether a given month has 28, 29 (February), 30 or 31 days; the database will do that for us.

```
SELECT id
FROM aircraft
WHERE produced_date >= '2010-01-01'
  AND produced_date <  '2010-01-01'::date + INTERVAL '1 month';
```

# Exercise

Count the number of flights performed within 180 days from the beginning of August 2015. Name the column flights.

```
SELECT COUNT(id) AS flights
FROM flight
WHERE flight_date >= '2015-08-01'
  AND flight_date <  '2015-08-01'::date + INTERVAL '180 day';
```

# The OVERLAPS operator

PostgreSQL has also another useful operator â€“ OVERLAPS:

```
(start1, end1) OVERLAPS
(start2, end2)
```

As you may guess, it yields true when the two time periods (defined by their endpoints) overlap, and false when they don't.

The OVERLAPS operator works great with intervals too:

```
(start1, interval) OVERLAPS
(start2, interval)
```

# Exercise

Let's see what aircraft were used while the Boeing 777-300 (ID of 8) was flying. In this exercise, just run the template query.

Note that you won't see aircraft that are still in use (those of NULL value in the withdrawn_timestamp column). We will learn how to show them in the next part of the course.

```
SELECT other.id, other.model
FROM aircraft other, aircraft boeing
WHERE boeing.id = 8
  AND other.id != 8
  AND (other.launched_timestamp,  other.withdrawn_timestamp) OVERLAPS
      (boeing.launched_timestamp, boeing.withdrawn_timestamp);
```

# The AGE() function

Let's look at the `AGE(start_timestamp)` function. 

It takes only one date and returns the difference between the current date and time, and the one given as the argument. Look at the example below:

```
SELECT AGE(flight_date)
FROM flight;
```

This query returns the time duration between today and the flight date.

# Exercise

For each aircraft show its ID and how much time has passed since withdrawing as the difference column.

```
SELECT
  id,
  AGE(withdrawn_timestamp) AS difference
FROM aircraft;
```

# The AGE() function â€“ continued

Sometimes we want to know, for example, how old a person was on the day of their death. We will use another syntax of the AGE() function:

`AGE(end_timestamp, start_timestamp)`

Note that the start_timestamp is counter-intuitively the second argument.

The query below returns an interval of time between withdrawn timestamp and launched timestamp:

```
SELECT AGE(withdrawn_timestamp, launched_timestamp)
FROM aircraft
WHERE id = 9;
```

The returned result is the actual difference between the time this aircraft was launched and the time it was withdrawn. The result of the AGE() is the interval.

# Exercise

For each aircraft, select its ID and show the difference in years, months, and days between its registration and production date (as the difference column).

```
SELECT id, AGE(registration_timestamp, produced_date) AS difference
FROM aircraft;
```

# AT TIME ZONE

Another thing we want to introduce is the conversion between various time zones. 

As you know, the route table provides the departure and arrival times in Central European Time. Let's see how we can show the same time in different timezones:

```
SELECT
  launched_timestamp AS original,
  launched_timestamp AT TIME ZONE 'Asia/Tokyo' AS tokyo
FROM aircraft;
```

As you can see, we need to write AT TIME ZONE followed by the timezone in apostrophes. In our database, we usually provide the time zone in the format Continent/City, but you need to watch out, because PostgreSQL has other conventions.

As you can see, we need to write AT TIME ZONE followed by the timezone in apostrophes. In our database, we usually provide the time zone in the format Continent/City, but you need to watch out, because PostgreSQL has other conventions.

# Exercise

For each aircraft that was withdrawn, show the model, and the same time in two time zones:

- local time of Paris (Europe/Paris) â€“ as the paris_time column.
- Pacific Standard Time (PST) â€“ as the pst column.

# The TO_CHAR() function

We can also use the TO_CHAR() function to format dates and times. It has a structure which looks like this:

`TO_CHAR(timestamp, format)`

The first argument is the date and time that will be formatted, and the second is a string specifying the format. This function returns a string or, if there's a problem, a NULL. Let's look at an example:

```
SELECT
  flight_date,
  TO_CHAR(flight_date,'Day, DD Month YYYY')
FROM flight;
```

The default date format is `YYYY-MM-DD`; therefore, for the flight with ID of 1 the date is '2016-04-03'. 

However, if we apply the TO_CHAR() function and the 'Day, DD Month YYYY' format, the date will be displayed as 'Sunday, 3 April 2016'. 

The 'Day' specifier in this format denotes the name of the day of the week, DD is the digit day of the month, 'Month' is the name of the month, and YYYY is the four-digit year.

This could be unwanted behavior, but you can change this by placing the FM modifier (which stands for fill mode, and it will suppress leading zeros and padding blanks) before each part that you don't want to have padding applied:

```
SELECT
  flight_date,
  TO_CHAR(flight_date,'FMDay, DD FMMonth YYYY')
FROM flight;
```


# Exercise

The company is using a new format for planned flight arrival times:

`HH.MI.SS AM`

`HH` is a two-digit hour, `MI` is the two-digits minute, `SS` is the two digit seconds, and AM is the meridiem indicator (without periods).

New times will look like this:

`08.12.05 PM`

For all planned arriving flights, show the arrival_time in the old and new format. Name the new column formatted_arrival_time.

```
SELECT
  arrival_time,
  TO_CHAR(arrival_time,'HH.MI.SS AM') AS formatted_arrival_time
FROM route;
```

# The TO_CHAR() function â€“ additional practice

Now we will learn more specifiers to convert the date to a new format. Let's look at this query below:

```
SELECT
  id,
  TO_CHAR(
    launched_timestamp,
    'DD Mon YY, HH12:MI:SS.US AM')
    AS formatted_launched_ts
FROM aircraft;
```

This query is for the aircraft with ID of 1 and a launched timestamp of `2014-06-10 07:55:0` and returns this date and time in new format:

You will find more format patterns in the documentation: https://www.postgresql.org/docs/10/functions-formatting.html


# Exercise

Let's show the code and the departure time for each route in a new format `HH24.MI.SS`, where:

- `HH24` is hour in the range 00-24.
- `MI` is minute in the range 00-59.
- `SS` is second in the range 00-59.

where the time components are separated by a dot. Name the new column formatted_departure_time.

```
SELECT
  code,
  TO_CHAR(
    departure_time,
    'HH24.MI.SS')
    AS formatted_departure_time
FROM route;
```

# The CURRENT_TIMESTAMP and NOW() functions

Now we'll learn how to get the current date and time.

PostgreSQL actually has several functions you can use to get the current date and time. Each function returns different details.

Let's start with the simplest function: `NOW()`. It returns the current date and time with time zone. Here's how you use it:

`SELECT NOW();`

It's very simple, right?

The `CURRENT_TIMESTAMP` function works exactly like NOW(). You don't need parentheses with this function, just the name will do:

`SELECT CURRENT_TIMESTAMP;`

This returns a date and time with fractional seconds and includes the time zone information.

Why do we have two functions that do the same thing? CURRENT_TIMESTAMP follows the ANSI SQL standard; NOW() is the PostgreSQL version.

`SELECT CURRENT_TIMESTAMP AS current_date_time;`


# The CURRENT_DATE and CURRENT_TIME functions

You can individually pull the local time or the local date with the CURRENT_DATE and CURRENT_TIME functions. The query below gets the current date and time:

`SELECT CURRENT_DATE, CURRENT_TIME;`

It returns the current date and time (with the time zone and full precision of fractional seconds), respectively.

# Exercise

Do you know how long until our flights arrive in hours? Check the difference between the current and arrival time of the routes. Select the route code and the difference of time between the arrival and now. Name this column difference_hours.

```
SELECT
  code,
  DATE_PART('hour', CURRENT_TIMESTAMP) - DATE_PART('hour', arrival_time) AS difference_hours
FROM route;
```

# Current date and time with intervals â€“ additional practice

Let's do one more exercise.

# Exercise

Find the code of all the routes which normally depart within three hours from the current time.

```
SELECT code
FROM route
WHERE departure_time BETWEEN CURRENT_TIME AND CURRENT_TIME + INTERVAL '3 hours';
```

# Summary

It's time to review what we know about date and time in PostgreSQL:

- PostgreSQL uses dates ('2010-01-01'), times ('13:00:00'), and timestamps ('2010-01-01 13:00:00').

- You can compare the above types with BETWEEN or basic operators like: <,<=,>,>=.

- You can specify the resulting order with ORDER BY.

- The TIMESTAMP data type allows you to save date and time data in your local time zone.

- To get parts of a date or time, use the EXTRACT() or DATE_PART() functions.

- Use the DATE_TRUNC(x, y) function to truncate the date and time (passed as y) to the given date or time part (passed as x).

- Use the INTERVAL operator to add or subtract a period of date or time.

- Use the operator :: to convert data types.

- Use the AGE(x, y) function to return the difference between the current date or between two dates, x and y, specified as arguments.

- Use converted time zones with AT TIME ZONE 'new_timezone'.

- Use TO_CHAR(timestamp, format) to display the date in a given format.

- To get the current date and time, use:
  - CURRENT_TIMESTAMP to get the timestamp with the time zone (or CURRENT_TIMESTAMP(p) where p is the precision of fractional seconds).
  - NOW() to get date and time with time zone.
  - CURRENT_DATE to get only the date.
  - CURRENT_TIME to get only the time with the time zone (or CURRENT_TIME(p) where p is the precision of fractional seconds).

Here's a link to the new schema for the rest of this section:

https://www.db-fiddle.com/f/tmuAtqDPnbjTv6dMsNmmaK/0

Or, you can copy and paste:

```
CREATE TABLE IF NOT EXISTS "product" (
    "id" INT,
    "category" TEXT,
    "name" TEXT,
    "type" TEXT,
    "price" NUMERIC(5, 2),
    "market1_price" NUMERIC(5, 2),
    "market2_price" NUMERIC(5, 2),
    "market3_price" NUMERIC(5, 2),
    "launch_date" TIMESTAMP,
    "production_area" TEXT,
    "shipping_cost" NUMERIC(3, 2),
    "description" TEXT
);
INSERT INTO "product" VALUES
    (1,'bedroom','Vaatekaappi','wardrobe',276.19,278.23,301.6,299.99,'2015-08-01 00:00:00','UE',0,'Feel invited to take a journey around this spacious wardrobe. Vaatekaappi is the number one choice for every luxurious bedroom!'),
    (2,NULL,'Spisebord','dining table',107.99,110.3,121,109.99,NULL,'UE',0,'Spisebord is a simple dining table which will fit in every living room. Its wooden pattern makes it ideal for every rustical home.'),
    (3,'living room','Salongbord','coffee table',112.79,133.5,120.7,NULL,'2016-01-01 00:00:00','China',5.99,'Created by a group of French designers, this coffee table will make your life much easier. Be it your favorite drink during afternoon tea time or your legs after a long day at work â€“ Salongbord will satisfy your needs.'),
    (4,'kitchen','Tekanna',NULL,10,15,17.8,19.99,'2015-02-25 00:00:00','UE',2.99,'This amazing tea kettle is equipped with a number of LED lights. Thanks to it, you will never lose your way when you want a cup of tea at night.'),
    (5,'kitchen','Haarukka','fork',2.5,1.99,1.99,NULL,'2014-07-05 00:00:00',NULL,1.99,'This award-winning fork has been with us for a long time. Feel the difference with our Haarukka. You will never get hungry again!'),
    (6,'bathroom','Handduk','towel',2.99,8.99,7,9.99,NULL,'China',1.99,'Three times smaller than your usual towel, yet still as efficient. Try Handduk today!'),
    (7,NULL,'Krus',NULL,8,15.68,16,12.99,'2013-04-30 00:00:00',NULL,2.99,'Resistance against hot temperatures makes this mug one of a kind.'),
    (8,'hall',NULL,'mirror',13.59,20.55,18.5,19.99,'2013-01-01 00:00:00','China',2.99,'Let''s you see your true inner self.');

```

# A quick review of NULLs

Let's do a quick review of NULLs.

A NULL indicates that a value is unknown or missing. You might see a NULL in the last_name field of a client table if you don't have the client's last name (because you forgot to ask!). You may have a NULL in the launch_date field of a product table if that product hasn't been launched.

A NULL in a product_price field doesn't mean that the product is free, just that we don't know the price.

We use the operators IS NULL and IS NOT NULL to check if a value is NULL. IS NULL works like this:

```
SELECT *
FROM product
WHERE category IS NULL;
```

# Exercise

Select name for all products whose launch_date isn't a NULL.

```
SELECT name
FROM product
WHERE launch_date IS NOT NULL;
```

# The COALESCE() function

Next, let's look at how the COALESCE() function can help with NULLs. This is a standard SQL function also used in PostgreSQL.

The `COALESCE(x, y)` function returns the first value that is not `NULL`. Check out the example:

```
SELECT
  name,
  COALESCE(category, 'none') AS category
FROM product;
```
In this query, a product with an associated category will have its name and category shown. If there is a NULL in a product's category field, the query will show "none" instead of a category name.

If you're wondering what the word "coalesce" means, it basically means "to come together, to form one group or mass." You can use coalesce literally (ingredients can coalesce into bread) or figuratively (ideas can coalesce).

# Exercise

Select the names and categories for all products. If any of these columns has a NULL, show 'n/a' instead. Rename the new columns to name and category.

```
SELECT
  COALESCE(name, 'n/a') AS name,
  COALESCE(category, 'n/a') AS category
FROM product;
```

# Data types in COALESCE()


 It's good to remember that COALESCE() takes an argument of only one data type. For instance, the following works fine:

```
SELECT COALESCE(price, 0.00) AS price
FROM product;
```
The price column is of decimal data type; therefore we replace its 0.00 value which is the same data type. This function will return 0.00 in place of a NULL value in the price column.

Check it out yourself. Try to use the COALESCE() function to show the product name and the launch_date or 'no date' when the date is unknown.

# Using COALESCE() with other functions

You can also use COALESCE() with other functions and operations, such as concatenation, multiplication, etc. Take a look:

```
SELECT
  COALESCE(category, 'unknown category')
    || ': '
    || COALESCE(type, 'unknown type')
    AS category_type
FROM product;
```

In the above query fragment, a NULL category or type value is replaced with an appropriate message, but we can still see the type when the category is NULL (and vice versa).

# Exercise

Show the following sentence:

`Product X is made in Y.`

X is the product name and Y is the production area. If the product name is not provided, display 'unknown name' instead. If the production area is not provided, substitute 'unknown area'. Name the column origin.

```
SELECT
  'Product '
    || COALESCE(name, 'unknown name')
    || ' is made in '
    || COALESCE(production_area, 'unknown area')
    || '.'
    AS origin
FROM product;
```

# Using COALESCE() in calculations

You can also use `COALESCE()` in calculations:

```
SELECT COALESCE(price, 0) * 1.05
FROM product;
```

This will return each product's price times 1.05 (if there's a price value) or a zero if the price is NULL.

# Exercise

The company is giving a 10% discount on all prices for in its first market shop. Show the names of all products, their current price (market1_price), and the new discounted price. Name the new column new_market1_price. If there is no price, show 0.0.

```
SELECT
  name,
  market1_price,
  COALESCE(market1_price * 0.9, 0.0) AS new_market1_price
FROM product;
```

# Using COALESCE() with multiple parameters

The last thing you should know about COALESCE() is that it can take more than two arguments. It will simply look for the first non-NULL value in the list and return it.

```
SELECT COALESCE(name, id::char, 'n/a')
FROM product;
```

The above function will show a product name. If the name is unknown, it will show the product id instead. If both the name and id are unknown, it will simply show 'n/a'.


# Exercise

Show each product's name and type. When the type is unknown, show the category. If the category is missing too, show 'No clue what that is'. Name the column type.

```
SELECT
  name,
  COALESCE(type, category, 'No clue what that is') AS type
FROM product;
```

# The GREATEST() function

The next function you'll get to know is GREATEST(), used to select the largest value among values given as arguments. Look at the first example of the function GREATEST():

```
SELECT
  id,
  GREATEST(market1_price, market2_price) AS largest_price
FROM product;
```

How does it work? In our database, each product has three different prices in three different shops (columns: market1_price, market2_price, market3_price). For each product, the query above displays, the largest price between shop 1 and shop 2.

Don't consider using the MAX() function, as it's a not good solution. Why? The MAX() function is an aggregate function. It returns only one value â€“ the greatest value in a column and it collapses all the rows. The GREATEST() function finds the largest value from a list of expressions. It can select a different value for each row.

# Exercise

Find the largest price for each product among all three shops. Select ID, the name of the product and the largest price as the largest_price column.

```
SELECT
  id,
  name,
  GREATEST(
    market1_price,
    market2_price,
    market3_price
  ) AS largest_price
FROM product;
```

# The LEAST() function

Similar to the GREATEST() function there is the LEAST() function. Here is the query using it:

```
SELECT
  id,
  LEAST(market1_price, market2_price) AS smallest_price
FROM product;
```

This query returns the lowest price between shop 1 and shop 2.

# Exercise

Find the smallest price of each product among prices in all three shops. Select ID, the name of the product, and the smallest price as the smallest_price column.

```
SELECT
  id,
  name,
  LEAST(
    market1_price,
    market2_price,
    market3_price
  ) AS smallest_price
FROM product;
```

# The GREATEST() and the LEAST() with NULL

What if a value in the list of arguments in GREATEST() or LEAST() functions is NULL? They omit NULL and return the largest or the least values for those different than NULL. The query looks like this:

```
SELECT
  id,
  LEAST(market2_price, market3_price) AS smallest_price
FROM product;
```

For the product with ID of 5 it returns 1.99. This comes from the market2_price column because the market3_price stores NULL; therefore it is ignored.

NULL is returned only if all arguments are NULL.

# Exercise

For the product with ID of 3 show its name and the largest_price in all three shops.

```
SELECT
  name,
  GREATEST(
    market1_price,
    market2_price,
    market3_price
  ) AS largest_price
FROM product
WHERE id = 3;
```

# The NULLIF() function

Another useful function, albeit one that's less frequently applied, is NULLIF(x, y).

It returns a NULL if both x and y are equal. Otherwise, it returns the first argument. 

For example, NULLIF(5, 4) returns 5, while NULLIF(5, 5) returns NULL.

Why would you use this function? 

Because it helps you avoid division by zero. Consider this example:

We have 10,000 and want to give an equal amount to a number of people. There's a number stored in the all_people column. However, some people are rich and don't need the money, and their number is stored in the rich_people column. Now, if we want to decide how much a single 'not-rich' person should receive, we could write:

`10000 / (all_people - rich_people)`

This query works fine, unless all the people are rich. We will then get a 0 in the denominator.

As you know, we can't divide by zero, so the database will return an error. We can use the NULLIF() function to solve this problem:

`10000 / NULLIF(all_people - rich_people, 0)`

NULLIF() checks if the subtraction equals 0. If it does equal 0, the function returns a NULL; otherwise it just gives the result of the subtraction.

Dividing by zero is illegal in PostgreSQL, but dividing by NULL will just give a NULL. In this way, we can prevent our database from producing an error.

# Exercise

Today, Home made yours has a special offer: the price of each product has decreased by 1.99. This means some products may be free!

A customer has 1,000.00 and would like to know how many of each product he could buy. Show the name of each product and the quantity he could buy (i.e., divide 1000.00 by the new price of each product).

In case of division by zero, return a NULL. Most products will have a decimal part, but don't worry about it.

```
SELECT
  name,
  1000.00 / NULLIF(price - 1.99, 0) AS quantity
FROM product;
```

# Exercise

Show the name of each product and the ratio column calculated in the following way: the price of each product in relation to its shipping_cost in percent, rounded to an integer value (e.g., 31).

If the shipping cost is 0.00, show NULL instead.

```
SELECT
  name,
  ROUND(price / NULLIF(shipping_cost, 0) * 100) AS ratio
FROM product;
```

# Exercise

Mr. Adams wants to launch a new promotion: Each customer who orders a product and picks it up (i.e., no shipping required) can buy it at a special price: the initial price minus the shipping_cost! If the shipping_cost is greater than the price itself, then the customer just pays the difference (i.e., the absolute value of price - shipping_cost).

A customer has 1,000.00 and wants to know how many of each product she could buy. Show each product name with the quantity column (which calculates the number of products she can buy for 1,000). Get rid of the decimal part. If you get a price of 0.00, show NULL instead.

```
SELECT
  name,
  FLOOR(1000.00 / NULLIF(ABS(price - shipping_cost), 0)) AS quantity
FROM product;
```

# Summary

Now it's time to review what we've learned:

- The `IS NULL` operator checks if a column value is NULL.

- The `IS NOT NULL` operator checks if a column value is not NULL.

- `COALESCE(x, y, ...)` returns the first non-NULL argument or replaces a NULL with the value given in the second argument.

- The `GREATEST()` and `LEAST()` functions return the largest and the smallest value among values in the argument list, respectively.

- The `NULLIF(x, y)` function returns NULL if x = y. Otherwise, it returns x.

# Exercise

Show all product names and the 3rd market shop's prices (casted to char). If the price is NULL, display 'unknown'. The price column should be named price.

```
SELECT
  name,
  COALESCE(CAST(market3_price AS char), 'unknown') AS price
FROM product;
```

# Exercise

For each product, show three columns:

- id

- product_type â€“ the type of the product. If there is no product type, show 'unknown type'.

- new_launch_date â€“ the launch date. If the launch_date is NULL, show the current date instead (use CURRENT_DATE).

Order the results by new_launch_date, with the oldest dates appearing first.

```
SELECT
  id,
  COALESCE(type, 'unknown type') AS product_type,
  COALESCE(launch_date, CURRENT_DATE) AS new_launch_date
FROM product
ORDER BY 3;
```

# Homework



```
CREATE TABLE IF NOT EXISTS "person" (
    "id" INT,
    "branch_id" INT,
    "first_name" TEXT,
    "middle_name" TEXT,
    "last_name" TEXT,
    "registration" TIMESTAMP,
    "iq" INT,
    "weight" NUMERIC(8, 6),
    "height" INT
);
INSERT INTO "person" VALUES
    (1,1,'Manuel','Carson','Krupp','2014-11-21 00:00:00',155,79.029999,171),
    (2,1,'Herschel','Maxwell','Woolwine','2013-06-17 00:00:00',156,81.959999,173),
    (3,1,'Josef','Garfield','Shorty','2013-07-23 00:00:00',148,97.510002,161),
    (4,1,'Ernest','Valentin','Terpstra','2015-07-04 00:00:00',NULL,74.940002,170),
    (6,2,'Weston','Jarod','Santillan','2014-04-11 00:00:00',152,97.790001,165),
    (7,2,'Clemente','Forest','Prim','2012-06-22 00:00:00',155,65.32,173),
    (8,2,'Millard','Jackie','Friscia','2014-02-06 00:00:00',152,63.779999,175),
    (9,2,'Robt','Victor','Dunmore','2015-06-22 00:00:00',148,76.690002,177),
    (10,2,'Marcos','Luke','Moree','2012-12-31 00:00:00',153,84.230003,164),
    (11,2,'Jana','Elease','Pullman','2016-04-05 00:00:00',149,92.269997,175),
    (12,3,'Paulina','Anisha','Gregg','2016-05-04 00:00:00',NULL,72.279999,165),
    (13,3,'Latarsha','Dorthea','Urenda','2012-05-19 00:00:00',151,70.239998,183),
    (14,3,'Louann','null','Eddington','2016-02-01 00:00:00',155,80.120003,162),
    (15,4,'Alane','Stasia','Wetherby','2015-03-03 00:00:00',149,77.529999,168),
    (16,4,'Jeniffer','null','Nussbaum','2014-07-27 00:00:00',155,70.82,184),
    (17,4,'Hulda','Kina','Esteban','2012-06-13 00:00:00',NULL,74.459999,162),
    (18,4,'Idalia','Ka','Tarnowski','2016-01-04 00:00:00',155,67.43,175),
    (19,5,'Maryanne','Micki','Salters','2013-08-03 00:00:00',150,89.290001,165),
    (20,5,'Modesta','Faustina','Hout','2021-03-17 00:00:00',152,79.669998,177),
    (5,2,'Gerry','Danial','Yanez','2021-02-17 00:00:00',155,63.029999,182);
```

# Exercise

Show the first, middle, and last name of each person together in one column (name this new column full_name). Format it like this:

`First_name Middle_name LASTNAME`

In other words, capitalize the first letter of the first and middle names, and show the last name uppercased.

Show this information only for people whose last names are at least 7 characters long. If a person has a NULL middle name, show an empty string for this middle name.

```
SELECT
  INITCAP(first_name)
    || ' '
    || COALESCE(INITCAP(middle_name), '')
    || ' '
    || UPPER(last_name)
    AS full_name
FROM person
WHERE LENGTH(last_name) >= 7;
```

# Exercise

The IQ society created a dating website for its members. We need to anonymize the user data before members go on their first date. For each person, show the following sentence:

XYZ lives in A and weighs B kilograms.
XYZ is the person's initials (XZ if a person has no middle name), A is the city where they live, and B is their weight, rounded to the nearest integer. Don't forget about the period at the end of the sentence!

```
SELECT
  CONCAT(
    UPPER(LEFT(first_name, 1)),
    UPPER(LEFT(middle_name, 1)),
    UPPER(LEFT(last_name, 1)),
    ' lives in ',
    city,
    ' and weighs ',
    ROUND(weight),
    ' kilograms.') AS sentence
FROM person
JOIN branch
  ON person.branch_id = branch.id;
```

# Exercise

For each person, show their first and last name along with their precise weight, their weight rounded down (name this column weight_down) and their weight rounded up to the next integer (name this column weight_up).

```
SELECT
  first_name,
  last_name,
  weight,
  FLOOR(weight) AS weight_down,
  CEIL(weight) AS weight_up
FROM person;
```

# Exercise

For each branch, show its ID, country, city, and the average IQ of its members, rounded to 2 decimal places as the avg_iq column.

```
SELECT
  branch.id,
  country,
  city,
  ROUND(AVG(iq), 2) AS avg_iq
FROM person
JOIN branch
  ON person.branch_id = branch.id
GROUP BY
  branch.id,
  country,
  city;
```

# Exercise

For each person who registered in the last 3 months, show their first_name, last_name and the interval showing how long they've been a member (subtract the registration from CURRENT_DATE) as the member_for column.

```
SELECT
  first_name,
  last_name,
  CURRENT_DATE - registration AS member_for
FROM person
WHERE registration > CURRENT_DATE - INTERVAL '3 month';
```

# Exercise

Count the number of people who registered in each month of 2015. Show two columns: month and count. You don't need to show months without registrations.

```
SELECT
  EXTRACT(MONTH FROM registration) AS month,
  COUNT(id) AS count
FROM person
WHERE registration BETWEEN '2015-01-01' AND CAST('2015-01-01' AS DATE) + INTERVAL '1 year'
GROUP BY EXTRACT(MONTH FROM registration);
```